[{"model": "books.book", "pk": 4, "fields": {"title": "The Order of the Midnight Sun", "author": "JJJ-thebanisher", "published_date": "2017-12-04T23:29:20"}}, {"model": "books.link", "pk": 9, "fields": {"title": "Introduction", "book": 4, "content": "The hooves beat noisily on the road.  Eight sets of them, each bearing a rider.  The men were hidden behind crimson cloaks. They were so cloaked that you couldn't see their faces whatsoever. The sun beat down on them but they didn't seem to care.  As they passed, people's eyes moved away from them in any way possible.  One older man even went to the extreme of staring straight upwards in order to avoid looking at the eight riders as they passed at incredible speeds.  They headed west.", "links": [10]}}, {"model": "books.link", "pk": 10, "fields": {"title": "Chapter 1", "book": 4, "content": "Last night had been strange indeed.  You're pretty sure that how it happened isn't how it was supposed to happen.  The way the adults always talked about it, well your experience didn't properly resemble their descriptions.  These thoughts and more pass through your mind as you continue to harvest various fruits.  Since it's such mindless work, and you've done it literally millions of times, you see no harm in continuing your train of thought.  Yesterday had begun like any other day in Ni Town. Work.  Truth be told, Ni Town isn't really a town, whoever named it must have been ambitious or something, you thought.  You wouldn't classify it as a village either, it did have a couple hundred people, plenty for a village, but it was more of a farming community.\r\n\r\nYesterday was the summer solstice, and with it came an incredible celebration.  When work ended just before dusk, the partying began.  Your favorite party of the year, because it's also your birthday, it featured the entire village with the best musicians and dancers among you performing.  Your favorite musician, Lianna Elma, who is also the best friend of your father, performed a stunning ballad and some dance songs and her best friend, Maya Korman, naturally danced.  The Korman family interests you, they always have, but especially now.  Maya's husband Travis is a burly man who leads the lumber brigade that supplies the communities wood.  He's more aggressive than a dog with rabies. And you've killed a dog with rabies.\r\n\r\nTheir daughter Artemis is where things get weird.  Last night she kissed you, and that was a pleasant surprise.  You're 14 and you know your handsome for your age so it wasn't your first kiss or anything but she's really pretty and it was certainly your best one.  The shock of your mother's death has long since worn off and since you're dad is also pretty attractive, he was chatting with many girls, so he didn't notice you and Artemis. More importantly, Travis Korban didn't either.  After half an hour together, you retired to your house.  You knew your dad would come home drunk off of wheat beer and go straight to his room. The two of you moved together over the earthen floor, while making out, and avoiding knocking anything over. Quite a feat.  Finally, it was to your room and the real fun began.  Obviously, you were nervous for your first time but she knew what she was doing, and losing your virginity was unbelievable.  She was on top of you, moving in the most perfect ways, up and down in a magnificent rhythm.  Her hands moved across you, stimulating you in with casual, heated precision.  The words she whispered in your ear tread the balance of nice and naughty. She felt a lot older than your age of fourteen.  Everything was fine up to the climax.\r\n\r\nJust before it happened, everything seemed clear. You felt as if you could see over fantastic distances and into the minds of hundreds of thousands of people. You felt infinitely powerful, as if you could control the essence of the world itself. A tough feeling to explain.  When it did happen, she went flying off of you at least four feet into the air and backwards off the bed, to land unconscious before she hit the ground.  Last night was weird, and not how the adults explained it.  She woke up an hour later and neither of you talked about it, but she seemed scared and went straight home.\r\n\r\nYou snap back to the present and turn to see Travis Korban moving towards you with a glint in his eye.", "links": [11, 12]}}, {"model": "books.link", "pk": 11, "fields": {"title": "Turn and Run", "book": 4, "content": "With the adrenaline of fear coursing through your veins, you turn tail and run the opposite direction, conveniently towards your house.  You check behind your shoulder to see Travis running after you. At fourteen you're surprisingly strong for your size, you weigh about one hundred and thirty pounds and you're about five foot nine but you're much stronger than most of the fifteen or sixteen year olds, however you know you'd probably be no match for Travis Korban. Essentially, he's huge.  Luckily he's not fast.\r\n\r\nYou race towards your house for lack of a better idea, and thankfully see your father walking towards you questioningly.\r\n\r\n\"Everything alright, Ari?\"\r\n\r\n\"Travis Korban is chasing me!\"\r\n\r\nJust then Travis rounded the corner of a nearby house, a little out of breath and very mad.\r\n\r\n\"You're going to pay, kid.\"\r\n\r\n\"What's going on?\" Your dad asked, confused.", "links": [14, 13]}}, {"model": "books.link", "pk": 12, "fields": {"title": "Wait to See what He has to say", "book": 4, "content": "He walks up to you.\r\n\r\n\"You stupid pathetic piece of shit, excuse for a boy.\" He leads.\r\n\r\nYou gulp.\r\n\r\nJust then, your dad rounds the corner of a nearby house and sees the two of you.\r\n\r\n\"What's going on here?\"", "links": [14, 13]}}, {"model": "books.link", "pk": 13, "fields": {"title": "Tell your dad about having sex", "book": 4, "content": "\"Erm.. Last night, Artemis and I sort of got together.\"\r\n\r\nYour dad looks taken aback and then smiles and looks at Travis inquisitively.\r\n\r\n\"And that ain't all! My daughters hurt because of your piece of shit kid.\" Travis spews and goes a little red.\r\n\r\n\"I'm sure that was an accident, Ari would never hurt a girl on purpose.\" Your father says.\r\n\r\n\"Yeah, dad, it was.\"\r\n\r\n\"That don't matter, he's gotta pay.\" Travis takes a step forward and shakes his fist.\r\n\r\nJust then, Artemis walks around the corner, obviously in pain.  Her beautiful green eyes, contrasting her pale face, beautiful features and dark wavy hair perfectly.  She's always been slender but she looks just perfect now.\r\n\r\nShe looks at you beseechingly, as if to say sorry.", "links": [16, 15]}}, {"model": "books.link", "pk": 14, "fields": {"title": "Say Nothing", "book": 4, "content": "\"He sexed my daughter, that pathetic piece of shit excuse for a boy.\" He spews out violently.\r\n\r\nYour father glances at you, you look away.\r\n\r\n\"What's to be ashamed of? Good for you Ari, there's nothing wrong with being with a girl.\" He says reassuringly. \"I was wondering when it would happen.\"\r\n\r\nIf looks could kill, your dad would be dead. Travis stared at him with such hatred.\r\n\r\n\"And that ain't all! My daughters hurt because of your piece of shit kid.\" Travis spews and goes beat red.\r\n\r\n\"I'm sure that was an accident, Ari would never hurt a girl on purpose.\" Your father says.\r\n\r\n\"Yeah, dad, it was.\"\r\n\r\n\"That don't matter, he's gotta pay.\" Travis takes a step forward and shakes his fist.\r\n\r\nJust then, Artemis walks around the corner, obviously in pain.  Her beautiful green eyes, contrasting her pale face, beautiful features and dark wavy hair perfectly.  She's always been slender but she looks just perfect now.\r\n\r\nShe looks at you beseechingly, as if to say sorry.", "links": [16, 15]}}, {"model": "books.link", "pk": 15, "fields": {"title": "Nod", "book": 4, "content": "She looks relieved to have gotten your forgiveness.\r\n\r\nTravis softens at the site of his daughter.\r\n\r\n\"If she gets pregnant or dies from this. I'll kill you boy.\"\r\n\r\nYou look taken aback, none of this had occurred to you.\r\n\r\nYou offer your help to the Korban family, and your dad looks impressed.  Suddenly, you hear something in the distance.", "links": [18]}}, {"model": "books.link", "pk": 16, "fields": {"title": "Look Away", "book": 4, "content": "When you look back, she looks extremely sad.\r\n\r\nTravis softens at the site of his daughter.\r\n\r\n\"If she gets pregnant or dies from this. I'll kill you boy.\"\r\n\r\nYou look taken aback, none of this had occurred to you.\r\n\r\nYou offer your help to the Korban family, and your dad looks impressed.  Suddenly, you hear something in the distance.", "links": [18]}}, {"model": "books.link", "pk": 17, "fields": {"title": "Upon Awakening", "book": 4, "content": "You wake up thoroughly dazed and even more exhausted.  You prop your head up and look around. You're in a circle of runes. The circle is about six feet in diameter and each rune has a circle on it.  The runes look like they're precisely placed at intervals. Artemis is laying asleep but she opens her eyes when you prop your head up.\r\n\r\n\"I didn't mean to tell him. I felt and feel really hurt and I needed to tell someone, so I told my mother but dad overheard. I'm sorry.\"\r\n\r\nJust then, the thoughts of both of your parents enters your minds and you clutch one another sobbing.\r\n\r\nAfter a few minutes, you both fall asleep exhausted in eachother's arms.", "links": [20]}}, {"model": "books.link", "pk": 18, "fields": {"title": "The Sound", "book": 4, "content": "What you thought was a sound in the distance, was actually the sound of a huge black horse and rider in a crimson robe about six feet away from your father's back. You have no idea how he managed to stay downright invisible and silent for so long. You had been looking in the direction he must have come from and you should have seen him from a kilometer at least.\r\n\r\nYour dad still hasn't noticed him, and none of the others seem to be able to see him. You scream.\r\n\r\n\"AHH. DAD!\" Your dad wheels around and finally sees the mysterious rider.\r\n\r\nTravis and Artemis notice him too, just in time to see your fathers head lopped clean off.  Instantly, in what seemed like under a half a second, the rider had drawn a perfectly concealed black blade about seven feet long from the side of his horse and chopped effortlessly through your dad's neck, sending his severed head to your feet.\r\n\r\nBlood gushes everywhere, and you see that a similar situation had happened at seven other parts of the village. There were eight riders and without torches, they were lighting the houses on fire.  Men were dying left, right and center.  You take all this in, in a second and look back to the rider in time to see Travis disemboweled seemingly without a fight. Blood, guts and feces hitting the ground with a splat.  The rider was unstoppable, he wheeled and set his attention on you.  His sword pointed at you, the blade as black as night with a crimson hilt to match the crimson robe that concealed his entire body.\r\n\r\n\"This is the one.\" He says in a voice so loud, it could probably be heard at the towns that Ni Town supplies with food, a days ride east.\r\n\r\nAll eight riders simultaneously turn and move towards you, surrounding you before you can move.\r\n\r\n\"Kill him.\"", "links": [19]}}, {"model": "books.link", "pk": 19, "fields": {"title": "There is naught you can do", "book": 4, "content": "Your mother died at the time of your birth, and now it seemed fitting that your father had died right around the time of your death.  All eight black blades move towards you and you feel every life remaining in Ni Town save one simultaneously extinguish. The riders move back a little, nearly falling off their horses. Their blades don't bury themselves in you, instead leaving eight claw like marks (4 on either side of your neck) running from your collarbones to the point in between your nipples on your chest.\r\n\r\nIt only shocked them for a second and they go to leap back onto you, but suddenly twenty men on various horses, wielding normal swords but with deadly accuracy and precision, almost on par with the dark riders appear and crash onto the eight dark riders with a resounding boom like a thousand waves reaching the shore. You roll out of harms way, right into Artemis, who had been hiding in the rubble of a house.  She was unconscious, did you do that? Again?\r\n\r\nYou fall asleep due to an unexplainable sheer exhaustion.", "links": [17]}}, {"model": "books.link", "pk": 20, "fields": {"title": "Re-Awakening (Chapter 2)", "book": 4, "content": "You open your eyes again, this time it's dark, but the nice kind of dark before the dawn.  You cry for a moment, over your father but resolve to set it behind you for the time being. Artemis is sitting beside you, clutching her abdomen, she looks to be in pain. This time the two of you are not alone, just outside the rune circle four men sit cross legged eating what looks to be chicken that they evidently had cooked on the effulgent fire that they had built.\r\n\r\nThe site of the fire makes you feel a little better.  Artemis lays down.\r\n\r\n\"My friend is hurt.\" You say.\r\n\r\nThe men simultaneously turn to look at you, evidently noticing that you're not asleep for the first time.  Three are bearded, one blonde haired, one brown haired and one with a fiery orange beard and hair. The fourth man had no hair, but his face was the most attractive, friendly and youthful of the bunch. He speaks.\r\n\r\n\"Unfortunately, our healing runes and healers are at Icarus.\" He pauses. \"We'll leave for there, tomorrow at noon. You should get some sleep, it's nearly dawn.\"\r\n\r\n\"I've been sleeping for what seems like forever! Who are you guys anyway?\"\r\n\r\n\"I'm Gavin.\" The bald one says. \"I'm a Philosophus in the Order of the Midnight Sun.\"\r\n\r\nYou stare blankly.\r\n\r\n\"I'm Trowell.\" Says the orange-bearded man. \"This is Peter,\" he says and points to the brown haired man, \"and this is Shwott,\" he says and points to the man with the black hair.\r\n\r\n\"My names Scott. Shut up Trowell.\" Says Scott. \"The three of us have attained the rank of Practicus in the order and you were a big part of our CQ.\"\r\n\r\nFinally, Peter chimes in. \"Call him Shwott, everyone else does.\" He laughs. \"I'm sure you've got some questions, what do you want to know?\"", "links": [26, 21, 24, 22, 23, 25, 27, 28]}}, {"model": "books.link", "pk": 21, "fields": {"title": "Who were the men in the crimson robes?", "book": 4, "content": "\"Those were Crimson Knights.\" Gavin replies. \"They're a vicious bunch, competing with the OMS (Order of the Midnight Sun) and they have different goals for the world than we do.\"\r\n\r\nHe pauses.\r\n\r\n\"They sensed two things in you, a little while before we managed to sense them.  The first is your true will and that's your positive spirit, meaning that you would be near on impossible to corrupt. The second thing they sensed was your erm.. potential.\"\r\n\r\nHe pauses again.\r\n\r\n\"I can't go into that one, sorry. It's against order rules and to be completely honest, the higher-ups haven't told anyone, so I don't know. Suffice it to say, that if they couldn't have you, they wanted to make sure that we couldn't either. So they came to kill you. Luckily you managed to hold them off for a moment so that we could come and help you and her.\"\r\n\r\nHe points to the now sleeping Artemis.", "links": [26, 24, 22, 23, 25, 27, 28]}}, {"model": "books.link", "pk": 22, "fields": {"title": "What's the Order of the Midnight Sun?", "book": 4, "content": "\"The OMS is an ancient order dedicated to a set of ethics, and a knowledge of ether, combat and history.\" Peter replies.\r\n\r\n\"What's Ether?\"\r\n\r\n\"Sorry Ari, I can't go into that with you yet.\"", "links": [26, 21, 24, 23, 25, 27, 28]}}, {"model": "books.link", "pk": 23, "fields": {"title": "How did I do what I did?", "book": 4, "content": "\"I'm sorry Ari, I can't get into that with you yet, when we get back to Icarus you'll have a chance to learn everything.\"", "links": [26, 21, 24, 22, 25, 27, 28]}}, {"model": "books.link", "pk": 24, "fields": {"title": "What and Where is Icarus?", "book": 4, "content": "\"Icarus is a castle far to the north. We have means of traveling pretty quickly so it won't take too long.  Don't worry, Artemis will be OK because it won't be a super long trek.  Icarus is the home to the order of the midnight sun.\" Scott replies.", "links": [26, 21, 22, 23, 25, 27, 28]}}, {"model": "books.link", "pk": 25, "fields": {"title": "What are these runes and why am I in a circle? Can I leave?", "book": 4, "content": "\"I can't really go into what runes are or how they're made, but think of them as magic stones, I guess.  Essentially, each type of rune has a different function, these ones with the circles are hiding runes, it's very difficult to sense out a person with power inside of a circle of hiding runes.\" Gavin replies.\r\n\r\n\"I'm a person with power?\"\r\n\r\n\"Uhh, yeah. But I can't go into much more than that, wait until we get to Icarus.\" Gavin answers.\r\n\r\n\"Am I allowed to leave the circle?\"\r\n\r\n\"Yeah, but then we all have to expend energy hiding you, and we might as well wait until we're about to leave.\" Says Trowell.\r\n\r\n\"So how come you aren't all in circles?\"\r\n\r\n\"It comes with time.\" Replies Gavin.", "links": [26, 21, 24, 22, 23, 27, 28]}}, {"model": "books.link", "pk": 26, "fields": {"title": "What do your ranks mean?", "book": 4, "content": "\"Our ranks signify our position within the order.\" Replies Gavin.\r\n\r\n\"Are you high up?\"\r\n\r\n\"Not really,\" Gavin replies and pauses, \"I'm in rank six out of thirteen.\"\r\n\r\n\"You mean twelve, right Gavin?\" Says Trowell with a laugh.\r\n\r\n\"I believe in Ipsissimus.\" Gavin shoots back.\r\n\r\n\"Ipsissimus?\" You ask.\r\n\r\n\"It's the fictional highest rank of the order.\" Scott Replies.\r\n\r\n\"It might not be fictional, you never know.\" Says Peter.\r\n\r\n\"Look, it doesn't matter.\" Replies Gavin, he pauses. \"I'm at rank six and these three are at the 5th rank. Ranks one and two are not really order-ranks, they're pre-initiation.  Ranks three to five are the regular ranks.  Ranks six and seven are leadership ranks, pre-officer. Ranks eight, nine and ten are officer ranks. Ranks eleven and twelve are master ranks. And then there might be Ipsissimus which is simply universally beyond.\" Gavin spells out from memory.", "links": [21, 24, 22, 23, 25, 27, 28]}}, {"model": "books.link", "pk": 27, "fields": {"title": "What's a CQ?", "book": 4, "content": "\"CQ stands for Community Quest.\" Scott replies. \"It's one of three things that a Practicus in the order has to do to move up to Philosophus.\"\r\n\r\n\"I was your community quest?\" You ask.\r\n\r\n\"Well, things are a bit disorderly in the order right now, and I can't get into that, but we had some trouble mounting a large task-force to help out down here, but you were top priority, so we transfered twenty five men from their community quests into this one.\" Gavin explains.", "links": [26, 21, 24, 22, 23, 25, 28]}}, {"model": "books.link", "pk": 28, "fields": {"title": "No more questions, I'm going to sleep now.", "book": 4, "content": "\"Alright.\" Gavin says. \"We'll wake you when it's time to go.\"\r\n\r\nJust then Artemis wakes up. \"Hi.\" She says sleepily.\r\n\r\n\"Wait a second,\" you say. \"What exactly happened after I passed out? Actually, what exactly happened period.\"\r\n\r\nThe faces of the four men go from jovial to ashen instantly. \r\n\r\n\"I think you should get some sleep.\" Gavin says, suddenly seriously.\r\n\r\n\"No!\" You and Artemis verbalize in unison to each-others surprise.\r\n\r\nThe men exchange glances, and Gavin begins to speak.\r\n\r\n\"It started with some sort of incident. It would have happened the night before the Crimson Knight's showed up.\"\r\n\r\nYou rack your brain for a moment, then have it dawn on you. You glance at Artemis and she glances back, blushing.\r\n\r\n\"Whatever it was,\" Gavin pauses, smiling for a moment before returning to being dead serious, \"it was extremely powerful and sent a resonation throughout the land. Anyone sensitive to such things felt it.  The Crimson Knight's felt it first and they went to kill you, because they sensed that you were un-corruptible.\"\r\n\r\nArtemis smiles.\r\n\r\n\"When they arrived and realized it was you, they cornered you.  They were about to kill you, when a similar but even more powerful event happened.  It stalled them for a moment and killed every person in the village with no defense against such things.\"\r\n\r\nThat sinks in and you begin to cry.  Artemis looks at you for a moment, as if deciding whether or not to hate you.\r\n\r\n\"You killed my parents...\" She says quietly.\r\n\r\n\"I'm.. so.. sorry.\"\r\n\r\n\"It wasn't his fault.\" Gavin says, \"but somehow you survived Artemis. You were closest to him and felt the most of the blast and still survived.  The only explanation is that you have some form of potential as well, although not as great.  The wounds you have now are not physical, they are spiritual, your soul is damaged and we will need to heal you in Icarus.\"\r\n\r\n\"And if we don't make it in time?\"\r\n\r\n\"You'll die.  Like all of my compatriots who died defeating those Crimson Knights. Us four are the sole survivors of the twenty-five man strong task-force.  Those were high ranking knights we fought and most managed to get away anyway.\"\r\n\r\nArtemis latches on to you, crying. Her head touches the newly-formed scars formed from the blades of the Crimson Knights.\r\n\r\n\"It's scarred already..\" You murmur. \"How long was I asleep for?!\"\r\n\r\n\"Don't worry,\" Gavin says, \"you haven't been asleep for more than twelve hours. It's a property of the Mordial Blades that the Crimson Warrior's wield.  Just the contact of one would kill a normal person. Somehow, it's actually added to your abilities. It took our strongest runes to hide you.\"\r\n\r\n\"I need to sleep.\" You say, hugging Artemis close.\r\n\r\n\"We'll wake you when it's time to go. We're strongest at noon and that's when we'll leave.\"\r\n\r\nYou drift off to sleep with Artemis, again.", "links": [29]}}, {"model": "books.link", "pk": 29, "fields": {"title": "Re-Re-Awakening", "book": 4, "content": "You wake up extremely sweaty because of the shared body heat between you and Artemis, and the beating sun on you.  You're already tanned because of your work in the sun every day, but somehow Artemis has always remained pale and now she has a sunburn.\r\n\r\n\"You'll be riding with me, Ari.\" Gavin mentions as he picks up runes. \"Artemis will ride with Trowell.\"\r\n\r\nScott and Peter sit motionless on their horses with their heads bent down and eyes closed.\r\n\r\n\"What's with them?\" You ask.\r\n\r\n\"They're focusing on hiding you. We've never had such a hard time, it takes both of them. Their horses will follow ours, if they're interrupted, we could be in some trouble.\"\r\n\r\nOnce mounted on the white horses, the party sets off at impossible speeds, dodging obstacles, and performing heart-stopping stunts like jumping over a twenty foot wide river.", "links": [30]}}, {"model": "books.link", "pk": 30, "fields": {"title": "To Icarus", "book": 4, "content": "Little conversation could be made, but you maintain as much eye contact with Artemis as you could.  She seemed very sick and you're worried.  The party made an extreme amount of progress, never stopping.  By your reckoning, a one day trip could be made in about an hour at this pace, so after five hours of traveling, you realize just how far Icarus was north.\r\n\r\nAt the five and a half hour mark, you realize just how cold it had gotten.  It was both later and more northern.  Quickly the scenery changed from green to white, as snow dominated the landscape and you felt freezing.\r\n\r\nAt the seven hour mark, with the two comatose meditating order members horses still following well, Gavin cast a rune into the air. It floated about the party and warmth radiated down to you.  The symbol on the rune was a triangle.\r\n\r\nFinally, at the ten hour mark you arrive at the castle.  It's walls stretched upwards of two hundred feet and it looked completely impenetrable.  There is absolutely no snow withing a kilometer of the castle in any direction and it's warm and comforting within that range.  The horses slowed to a regular pace and you cross the drawbridge into the Icarus Castle Square.", "links": [31]}}, {"model": "books.link", "pk": 31, "fields": {"title": "Icarus Castle Square", "book": 4, "content": "Scott and Peter snap out of their trance, as the need for secrecy is evidently over.  You dismount from behind Gavin, when he asks you to, to find yourself in a busy crowd full of people in various uniforms and colors. The predominant color was blue but there was such variance.\r\n\r\n\"I've got to get these three to the medical wing. They're all in rough shape, I'll catch up to you later, Ari.  There's a bunch you can do before you come find me, if you'd like.  Go explore, or come straight to the medical wing.  Most of it will be off limits for now, but have fun anyway.\"\r\n\r\nHe begins to ride off.\r\n\r\n\"Wait, will Artemis be OK?\" You shout.\r\n\r\n\"She'll be fine.\" He shouts back over his shoulder.\r\n\r\nYou exhale.  You can't see much from where you are because of all the people, but there's a raised platform that you can get to, to get a better view.", "links": [32]}}, {"model": "books.link", "pk": 32, "fields": {"title": "To the platform", "book": 4, "content": "You get up onto the platform and can see over the crowd.  You're at an intersection lined with buildings.  You assume that the buildings around here are housing. You spot a sign that designates it as Regular Housing.  You can see a sign that points out of the castle for \"Not-Order\" housing.  You assume that the housing for the pre-initiates is outside.  There's higher ranked housing up the hill to your right.\r\n\r\nGavin went the way you're facing, the gates are behind you, and there's a road going left.  You assume you shouldn't leave the castle, considering you required to be hidden when you were outside.", "links": [33, 34, 35]}}, {"model": "books.link", "pk": 33, "fields": {"title": "Go Right", "book": 4, "content": "You get down from the platform and wade through the crowd of uniforms.  All of the uniforms that you see down here have at least one and up to four intricate designs and patterns and multiple colors, usually only white and blue although some have black.  There are a few people with no uniforms at all, like yourself.  You push through a group of people wearing Blue, White and black robes with four different patterns on them, and finally you realize why you can't see.  Everyone is so tall compared to you and you assume that they're all adults, and that you're by far the youngest person in the castle.\r\n\r\nYou get to the hill and get about half way up when an old man wearing a simple plain blue robe with no patterns stops you. He doesn't physically stop you or talk to you, but you simply stop.\r\n\r\n\"Hello.\" He says.\r\n\r\n\"Hi?\" You reply, uncertainly.\r\n\r\n\"Ari, you should turn around, this is off limits to anyone not of leadership class or above.\"\r\n\r\n\"OK.\" You turn around and walk back without even a thought of resisting.\r\n\r\nYou decide that it's certainly time to go find Gavin.", "links": [36]}}, {"model": "books.link", "pk": 34, "fields": {"title": "Go Straight Ahead", "book": 4, "content": "You get down from the platform and wade through the crowd of uniforms.  All of the uniforms that you see down here have at least one and up to four intricate designs and patterns and multiple colors, usually only white and blue although some have black.  There are a few people with no uniforms at all, like yourself.  You push through a group of people wearing Blue, White and black robes with four different patterns on them, and finally you realize why you can't see.  Everyone is so tall compared to you and you assume that they're all adults, and that you're by far the youngest person in the castle.\r\n\r\nYou see a sign that says: \"Straight ahead to the medical wing.\"\r\n\r\nYou decide to go find Gavin and Artemis.", "links": [36]}}, {"model": "books.link", "pk": 35, "fields": {"title": "Go Left", "book": 4, "content": "You get down from the platform and wade through the crowd of uniforms.  All of the uniforms that you see down here have at least one and up to four intricate designs and patterns and multiple colors, usually only white and blue although some have black.  There are a few people with no uniforms at all, like yourself.  You push through a group of people wearing Blue, White and black robes with four different patterns on them, and finally you realize why you can't see.  Everyone is so tall compared to you and you assume that they're all adults, and that you're by far the youngest person in the castle.\r\n\r\nYou get to the left, it's a winding road and there's a sign up ahead.  It says: \"To the Sparring Chamber, the Library and Generation Room.\" Then in smaller text it says: \"Generation Room and Sparring Chamber not open to anyone below Neophyte rank.\"", "links": [37]}}, {"model": "books.link", "pk": 36, "fields": {"title": "Towards the Medical Wing", "book": 4, "content": "You make your way to the medical wing, passing through various uniforms, you wonder what uniform signifies a higher rank. Finally, you make it to the medical wing, .\r\n\r\nIt's a large stone building within the castle, you enter and wait for your eyes to adjust to being inside before realizing that for some reason, you don't have to, they adjust instantly here.  You scope out Gavin, and find him, beside Peter's bed.\r\n\r\nYou walk over to him.\r\n\r\n\"What's wrong with Peter and Scott?\" You ask.\r\n\r\n\"They expended a lot of energy. They're Practicus' and so they have quite a bit of eth--- oh yeah, I can't talk about that yet. Suffice it to say that they've over extended for their rank by protecting you.\"\r\n\r\nYou feel really grateful. You nod.\r\n\r\n\"I'll thank them. How's Artemis?\"\r\n\r\nGavin points over his shoulder and you walk to her bed.  She's sleeping but as you walk over, she wakes up.\r\n\r\n\"Hey Ari!\" She says.\r\n\r\n\"Hey Artemis.\" You reply.\r\n\r\n\"I feel so healthy.. Like better than I have ever in my entire life. This place is wonderful!\"\r\n\r\nYou nod and are about to reply when Gavin shouts over.\r\n\r\n\"The Improvised Council wants to see you immediately. Let's go.\"\r\n\r\nYou kiss Artemis on the cheek before turning and following Gavin.", "links": [38]}}, {"model": "books.link", "pk": 37, "fields": {"title": "To the Library", "book": 4, "content": "You walk up to the library, a shorter man with a blue, white and black robe adorned with four different pattern stares at you.\r\n\r\n\"You're not a student. You're too young. How-come they let you into the castle?\"\r\n\r\nYou're about to answer when he butts in.\r\n\r\n\"Never-mind, you wouldn't be allowed to tell me anyway.  However, it's my job to keep all students out for right now, it's the one hour of the week where it's student access only, so come back another time, whoever you are.\"\r\n\r\nLooks like it's time to go find Gavin.", "links": [36]}}, {"model": "books.link", "pk": 38, "fields": {"title": "To the council chambers", "book": 4, "content": "You step out of the medical wing and see Gavin climbing a ladder on the side of the building. You wordlessly follow him, At the top of the ladder, there is another door.\r\n\r\n\"The council chambers are above the medical wing because all of the power convened here often helps people get better.\"\r\n\r\n\"Ingenious.\" You say.\r\n\r\n\"Hey, out of curiosity.. when's your birthday?\" He asks.\r\n\r\n\"Summer Solstice.\" You reply.\r\n\r\n\"Thought so.\"\r\n\r\n\"Why?\"\r\n\r\n\"Can't tell ya.\" He says with a laugh. \"Recurring theme, isn't it!\"", "links": [39]}}, {"model": "books.link", "pk": 39, "fields": {"title": "Into the Council", "book": 4, "content": "Inside the council chamber, things are quite different.  The air is incredibly cold but your mind feels refreshed. The inside of the room feels massive compared to how it looked on the outside.  The room is dominated by a huge circular table.  One part of the table has been removed to allow whoever the speaker is, to walk right to the middle of the table. Essentially it's a circular table with an aisle removed.  There are seventeen chairs and each is filled with a man wearing a white robe with no patterns. Gavin whispers in your ear:\r\n\r\n\"These men are Adeptus Exemptus.  Usually Magi sit at the council, but they.. can't be here right now.  Magi are ranked 12/12, the rank below them are Magister Templi but it's not really safe to be around a Magister Templi so Adeptus Exemptus will preside here.  I'm sorry for the confusion you must feel, they'll explain it all. I'm not allowed to stay. Good luck.\"\r\n\r\nBefore you could ask why you'd need luck, Gavin turns and leaves.  You see no other choice but to walk along the aisle to the middle of the table. You fidget under the seventeen stares.\r\n\r\n\"Sit.\"  One of the men says.\r\n\r\nA chair appears and you sit down in the middle of the table.\r\n\r\n\"Ari son of the late Maxwell.\"\r\n\r\nThey all wait.\r\n\r\n\"Yes?\" You say feebly.\r\n\r\n\"We have gathered here to talk of a matter that should be of great importance to you, that directly involves your safety --\"\r\n\r\nAnother man interrupts.\r\n\r\n\"Ari, if you would, could you remove your shirt please.\"\r\n\r\nThere is a murmur of agreement.", "links": [40, 41]}}, {"model": "books.link", "pk": 40, "fields": {"title": "Remove Your Shirt", "book": 4, "content": "You stand and remove your shirt. A collective gasp is shared by the council.  The eight scars are obviously something of a fascination to them. They murmur quietly:\r\n\r\n\"He...no...impossible.......alive?.....ridiculous!\"\r\n\r\nYou wait patiently.\r\n\r\n\"You may sit and put your shirt back on.  You agree, thankful to be a little less cold in the cold room.\r\n\r\n\"So, Ari.  Let me explain to you, how things work here for initiates.  We begin to pay attention to someone's hidden capabilities on their fifteenth birthday and if they look promising, we approach them on their seventeenth birthday with the option of living in our dormitories outside the castle walls and taking on the rank of student.\"\r\n\r\nYou nod.\r\n\r\n\"That won't suffice for you.  We cannot wait for that long, and you are too careless with your power to be allowed outside the castle walls.\"\r\n\r\nYou nod again.\r\n\r\n\"So, we have two options. The first is that you can break the protocol for teaching and we can teach you how to hide your energy now and then you can begin at the beginning in the student dorms outside, or we can skip those dorms and you can start at the regular dorms inside, about a year and a half ahead of schedule. If you choose this option, you'll still start at the beginning as a student, but you'll dorm with Neophyte's, Zelator's and Practicus'.\"\r\n\r\nHighlight the text after this for further description of the choices. Consider it an easy mode.  If", "links": [43, 44]}}, {"model": "books.link", "pk": 41, "fields": {"title": "Refuse", "book": 4, "content": "The first man replies coldly: \"I assume you thought that, that was a question.\"\r\n\r\n\"I was simply cold..\"\r\n\r\n\"If this were the real council, would we get more respect?\" Another man says, disgusted.", "links": [40, 42]}}, {"model": "books.link", "pk": 42, "fields": {"title": "Refuse Again", "book": 4, "content": "You've lost some serious council rep.\r\n\r\n\"So, Ari.  Let me explain to you, how things work here for initiates.  We begin to pay attention to someone's hidden capabilities on their fifteenth birthday and if they look promising, we approach them on their seventeenth birthday with the option of living in our dormitories outside the castle walls and taking on the rank of student.\"\r\n\r\nYou nod.\r\n\r\n\"That won't suffice for you.  We cannot wait for that long, and you are too careless with your power to be allowed outside the castle walls.\"\r\n\r\nYou nod again.\r\n\r\n\"We were going to give you a choice, but since you won't co-operate with us, we're not co-operating with you. Instead, we're placing you in the dorms with the normal ranked and not pre-initiate order members.  Your \"girlfriend\" will be living in the village until her seventeenth birthday.  Good day to you, Ari.\"\r\n\r\nWith that the council members leave.", "links": [43]}}, {"model": "books.link", "pk": 43, "fields": {"title": "Dorming with the higher ranks", "book": 4, "content": "You leave the council chambers and go to see Artemis but she's not there.  You go to leave the medical wing when Gavin catches up with you. You explain your situation and he seems really happy.\r\n\r\n\"That's awesome, you'll be dorming with Peter, Scott, and Trowell! Congratulations being the youngest student, ever, by the way!\"", "links": [45, 46]}}, {"model": "books.link", "pk": 44, "fields": {"title": "I'll take the extra training and dorm with the students", "book": 4, "content": "You leave the council chambers and go to see Artemis but she's not there.  You go to leave the medical wing when Gavin catches up with you. You explain your situation and he congratulates you on being the youngest student ever and wishes you luck.", "links": [45, 46]}}, {"model": "books.link", "pk": 45, "fields": {"title": "Go on your way", "book": 4, "content": "You spend about fifteen days working with a man named Frallwart, who describes himself as a \"cap-out\".  You inquired about what that meant when you first met him, and he explained it as:\r\n\r\n\"Reaching your full potential within the order.  I'm a Philosophus but I'll never cross the first abyss and for that reason, I'll never become a Dominus Liminus.  I've come as far as I'll ever go in the order, and at 38, there's not much hope, but that's OK because I get to train young guys like you. Although not usually as young as you, I must say. You must have done something right.\"\r\n\r\nYou liked Frallwart from the time you met him.  Over the fifteen days, you discovered that he actually taught Gavin the same technique of blocking your energy from the casual spy, he's been a Philosophus for a long time.  The first thing you did when you finally were able to control your energy readings was to run outside of the castle, straight for the village nearby. You hadn't seen Artemis in weeks and because she wasn't allowed to become a student until age seventeen, she couldn't enter the castle.\r\n\r\nShe had her own house, all expenses paid by The Order and you run into one another's arms.  This leads to some kissing and it becomes pretty heated, but you want to become a bit more controlled before you actually have sex again, you don't think you could contain your power.  According to the rules of The Order you couldn't actually live with her, but your dorm was across the street so it wasn't the largest issue ever.\r\n\r\nBetween studying and Artemis, you spent very little time in your dorm and you didn't meet anyone interesting among the other students.  As a Student rank, you have two tasks. Your first task is to become conceptually familiar with the aspects of the order and yourself, and the second task is to garner an extremely basic knowledge of the history of the order.  You must take your written test after being a student for one month.  Once you take your test, if you fail, you have to take it again exactly one month after and if you fail again, you forfeit your right to join the order.", "links": [47]}}, {"model": "books.link", "pk": 46, "fields": {"title": "Ask Gavin about the council", "book": 4, "content": "\"So where are the Magi?\"\r\n\r\n\"No one knows, to be honest. They just... disappeared.\"", "links": [45]}}, {"model": "books.link", "pk": 47, "fields": {"title": "To Study", "book": 4, "content": "You have 6 sessions available at the library. A Zelator charged with training students and wearing a blue and white robe with three different patterns shows you around the library and how to use your sessions and sign books out. He tells you that:\r\n\r\n\"If you're knowledgeable about a topic, don't waste your time on it.  Remember, if you fail your first test, you can try again a month after with six more study sessions, but if you can pass it first try, things bode well for you.  Keep in mind, you need to know some basic history and concepts. It is highly recommended that you take notes.\r\n\r\nTo further illustrate, you should be proficient in:\r\n\r\nA) What is Ether\r\n\r\nB) What is the form of combat used by the OMS called and what's it like.\r\n\r\nC) Who Founded the order?\r\n\r\nD) What's an abyss?\r\n\r\nE) What's Emerald Street\r\n\r\nF) How many official ranks are there in the order?\r\n\r\nG) What are the top five most high ranking robes?\r\n\r\nH)  What's a CQ?\r\n\r\nI) What's the first Leadership rank?\r\n\r\nJ) What's a cap-out?\"", "links": [48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58]}}, {"model": "books.link", "pk": 48, "fields": {"title": "Topic A", "book": 4, "content": "Ether is everything around you, from physical objects, to the air, to temperatures, to thoughts, to emotions, to absolutely anything else.  Ether is incredibly important because if you can learn to control the Ether itself then you have virtually limitless power over your surroundings and the people that occupy it.  Runes are simply stones that are soaked in a specific batch of chemicals known to OMS alchemists and then imbued with an ether affecting power by a powerful ether-user.  You can focus your abilities with ether by spending time meditating in the generator room, or in the far later ranks, by crossing abysses or dealing with deity's.", "links": [47]}}, {"model": "books.link", "pk": 49, "fields": {"title": "Topic B", "book": 4, "content": "You open up a book on combat because you think it will be crucial to the test:\r\n\r\nNon-ether based combat has always been crucial to the OMS. Ether is unpredictable and cannot be trusted until you are incredibly powerful but a good old fashioned blow to the head is quite the opposite.  OMS combat is called Midnight Regulation and a Master of Midnight Regulation is a master of sword and hand to hand, horse and foot and blind fighting.", "links": [47]}}, {"model": "books.link", "pk": 50, "fields": {"title": "Topic C", "book": 4, "content": "You open up a book on the formation of the order since you think it will be crucial to the test:\r\n\r\nThe order founder was Daleir Mcelley, and he is both the first and the last known true Ipsissimus, although there are others that could be argued to be on the same playing level.  He is the sole uncontested Ipsissimus and it is rumored that he currently resides as a deity and if someone could harness him and channel his power, they would be literally unstoppable.", "links": [47]}}, {"model": "books.link", "pk": 51, "fields": {"title": "Topic D", "book": 4, "content": "You open up a book on abyss's because you figure they will be important on the test:\r\n\r\nAn abyss is not a physical thing and performing the act known as \"crossing the abyss\" is not some matter of finding a chasm in the ground and going over it.  It's a total spiritual thing grounded in ether, that you must learn more about in the future.  It's most basic quality is that it pits you against yourself, and you must learn it's lesson to pass through.  There are two main abyss's on your path to spiritual perfection. The first is after the Philosophus rank and the other is after the Adeptus Exemptus rank.", "links": [47]}}, {"model": "books.link", "pk": 52, "fields": {"title": "Topic E", "book": 4, "content": "You open up a book on Emerald Street, because you figure it will be important to the test:\r\n\r\nEmerald Street is the tomb of Daleir Mcelley and His body is still apparently there, completely impossible to decompose by insects due to His sheer power.  It's rumored to be close to the west coast of the country but no one knows for certain, it's postulated that whoever found it might be one step closer to being able to communicate with the deity of Daleir Mcelley and perhaps channel the deity. It is rumored that if someone were able to channel the Ipsissimus Daleir Mcelley, they would be completely and literally unstoppable.", "links": []}}, {"model": "books.link", "pk": 53, "fields": {"title": "Topic F", "book": 4, "content": "You open up a book on official ranks because you figure it will be critical to the test:\r\n\r\nThere are 12 official ranks in the order, but it used to be that there were 13.  There has only been one confirmed Ipsissimus in order or world history and although that used to be a rank, it's been formally dropped because no one has been able to fill it in centuries.  Some would still consider it a rank just out of sheer respect for the founder of the order or for hope that it may one day be filled.", "links": []}}, {"model": "books.link", "pk": 54, "fields": {"title": "Topic G", "book": 4, "content": "You open up a book on order robes and uniforms because you figure it will be important for the test:\r\n\r\nEvery rank in the order has an associated robe that the user must wear in almost all situations.  Sometimes when traveling far from Icarus, it is dropped so as not to attract attention.", "links": [47]}}, {"model": "books.link", "pk": 55, "fields": {"title": "Topic H", "book": 4, "content": "You open up a book on CQ's because you think it will be important for the test:\r\n\r\nCQ stands for Community Quest. The OMS has prided itself on being a positive force in the country at large and the CQ's are a huge reason why.  To advance from Practicus to Philosophus, one must complete a community quest, among other things. CQ's are simply jobs required by the community, usually deemed worthy by an Adeptus Minor.  Very occasionally there are group CQ's but usually it's a solo effort.", "links": [47]}}, {"model": "books.link", "pk": 56, "fields": {"title": "Topic I", "book": 4, "content": "You open up a book on classes because you think it will be critical to the test:\r\n\r\nClasses are groups of ranks.  The first class is Not-Order, the second class is Regular, the third class is Leadership (Starting with Philosophus), the fourth class is Officer, and the final class is Master.  The unofficial rank of Ipsissimus is not given a class. Classes are used for many purposes. For instance, a Master Templi can not meet with ranks that have a lower class than Officer.  The Philosophus is meant to train ranks lower than Leadership, etc.", "links": [47]}}, {"model": "books.link", "pk": 57, "fields": {"title": "Topic J", "book": 4, "content": "You open a book on cap-outs because you think it will be critical for the exam.\r\n\r\nCap-outs are simply something that occur when a member of the OMS reaches a trial that they require to move up a rank but cannot complete and will never be able to complete.  If someone caps out at Neophyte, then they will be dispelled from the order, the same is true of capping out at the rank of student, but other cap-outs do not result in banishment. A member can remain at Neophyte for a maximum of two years only.\r\n\r\nMost common cap-outs:\r\n\r\nA) Student - Cannot pass tests.\r\n\r\nB) Neophyte - Has no basic ether talent, was mis-scouted by the order.\r\n\r\n\r\n\r\nC) Philosophus - Cannot cross the first abyss\r\n\r\nD) Dominus Liminus - Is not chosen by a master\r\n\r\nE) Adeptus Minor - Cannot converse with a deity\r\n\r\nF) Adeptus Exemptus - Cannot cross the second abyss\r\n\r\nG) Magus - Everyone caps out here except the one true Ipsissimus.\r\n\r\nAs you can see, only two cap-outs will get you expelled. You are expected to pass the neophyte rank.", "links": [47]}}, {"model": "books.link", "pk": 58, "fields": {"title": "I'm ready to take the test", "book": 4, "content": "One month has passed since you saw the council and you're about to take your student test.  You need a 10/15 on the test to pass.\r\n\r\n\r\nAri is now 14 years and 1 month(s) old.", "links": [59]}}, {"model": "books.link", "pk": 59, "fields": {"title": "Question 1", "book": 4, "content": "The first question states:\r\n\r\n\"What is a CQ?\"", "links": [60]}}, {"model": "books.link", "pk": 60, "fields": {"title": "Question 2", "book": 4, "content": "The second question states:\r\n\r\n\"What is a cap-out?\"", "links": []}}]